src/kotlin/functional/function.org
#+TITLE: 函数
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_HOME: ./functional.html
#+OPTIONS: num:nil timestamp:nil
* 声明

  Kotlin 中的函数使用 _fun_ 关键字声明：

  #+BEGIN_SRC kotlin 
  fun double(x: Int): Int {
      return 2 * x
  }
  #+END_SRC
* 用法
  调用函数使用传统的方法：

  #+BEGIN_SRC kotlin 
  val result = double(2)
  #+END_SRC

  调用成员函数使用 _点_ 表示法：

  #+BEGIN_SRC kotlin 
  Stream().read() // 创建类 Stream 实例并调用 read()
  #+END_SRC
* 参数

  函数参数使用 Pascal 表示法定义，即 _name: type_ 。参数用 _逗号_ 隔开。每个参数必须有 *显式* 类型：

  #+BEGIN_SRC kotlin 
  fun powerOf(number: Int, exponent: Int) { /*……*/ }
  #+END_SRC
** 默认参数
   函数参数可以有默认值，当省略相应的参数时使用默认值。与其他语言相比，这可以减少重载数量：

   #+BEGIN_SRC kotlin 
  fun read(b: Array<Byte>, off: Int = 0, len: Int = b.size) { /*……*/ }
   #+END_SRC

   #+BEGIN_EXAMPLE
     默认值通过类型后面的 = 及给出的值来定义
   #+END_EXAMPLE


   覆盖方法总是使用与基类型方法相同的默认参数值。 当覆盖一个带有默认参数值的方法时，签名中不能再有默认参数值：

   #+BEGIN_SRC kotlin 
  open class A {
      open fun foo(i: Int = 10) { /*……*/ }
  }

  class B : A() {
      override fun foo(i: Int) { /*……*/ }  // 不能有默认值
  }
   #+END_SRC

   如果一个默认参数在一个无默认值的参数之前，那么该默认值只能通过使用 _具名_ 参数调用该函数来使用：

   #+BEGIN_SRC kotlin 
  fun foo(bar: Int = 0, baz: Int) { /*……*/ }

  foo(baz = 1) // 使用默认值 bar = 0
   #+END_SRC


   如果在默认参数之后的 _最后一个_ 参数是 _lambda 表达式_ ，那么它既可以作为具名参数在括号内传入，也可以在括号外传入：

   #+BEGIN_SRC kotlin 
  fun foo(bar: Int = 0, baz: Int = 1, qux: () -> Unit) { /*……*/ }

  foo(1) { println("hello") }     // 使用默认值 baz = 1
  foo(qux = { println("hello") }) // 使用两个默认值 bar = 0 与 baz = 1
  foo { println("hello") }        // 使用两个默认值 bar = 0 与 baz = 1
   #+END_SRC
** 具名参数

   可以在调用函数时使用具名的函数参数

   #+BEGIN_EXAMPLE
     当一个函数有大量的参数或默认参数时这会非常方便
   #+END_EXAMPLE

   比如：
   #+BEGIN_SRC kotlin 
  fun reformat(str: String,
	       normalizeCase: Boolean = true,
	       upperCaseFirstLetter: Boolean = true,
	       divideByCamelHumps: Boolean = false,
	       wordSeparator: Char = ' ') {
  /*……*/
  }
   #+END_SRC

   可以使用默认参数来调用它：
   #+BEGIN_SRC kotlin 
  reformat(str)
   #+END_SRC

   然而，当使用非默认参数调用它时，该调用看起来就像：

   #+BEGIN_SRC kotlin 
  reformat(str, true, true, false, '_')
   #+END_SRC

   使用具名参数可以使代码更具有可读性：

   #+BEGIN_SRC kotlin 
  reformat(str,
      normalizeCase = true,
      upperCaseFirstLetter = true,
      divideByCamelHumps = false,
      wordSeparator = '_'
  )
   #+END_SRC

   并且如果不需要所有的参数：

   #+BEGIN_SRC kotlin 
  reformat(str, wordSeparator = '_')
   #+END_SRC


   当一个函数调用混用位置参数与具名参数时，所有位置参数都要放在 _第一个具名参数之前_ 

   #+BEGIN_EXAMPLE
     例如，允许调用 f(1, y = 2) 但不允许 f(x = 1, 2)
   #+END_EXAMPLE
   可以通过使用 _星号_ 操作符将 _可变数量参数_ (vararg) 以具名形式传入：

   #+BEGIN_SRC kotlin 
  fun foo(vararg strings: String) { /*……*/ }

  foo(strings = *arrayOf("a", "b", "c"))
   #+END_SRC


   #+BEGIN_EXAMPLE
     对于 JVM 平台：在调用 Java 函数时不能使用具名参数语法，因为 Java 字节码并不总是保留函数参数的名称
   #+END_EXAMPLE
