html/kotlin/functional/function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="./functional.html"> HOME </a>
</div><div id="content">
<h1 class="title">函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1c55bb">声明</a></li>
<li><a href="#orge4252b0">用法</a></li>
<li><a href="#org019589e">参数</a>
<ul>
<li><a href="#org7f6caca">默认参数</a></li>
<li><a href="#orgef4c86f">具名参数</a></li>
<li><a href="#orgbc15531">可变数量的参数</a></li>
</ul>
</li>
<li><a href="#org9c16161">返回</a>
<ul>
<li><a href="#orge9c9180">返回 Unit 的函数</a></li>
<li><a href="#orgbc394aa">单表达式函数</a></li>
</ul>
</li>
<li><a href="#org8f2ae6f">中缀表示法</a></li>
<li><a href="#orgcbd94b7">作用域</a>
<ul>
<li><a href="#org612d41b">局部函数</a></li>
<li><a href="#orge775e86">成员函数</a></li>
</ul>
</li>
<li><a href="#orgd182e40">泛型函数</a></li>
<li><a href="#org03dd288">内联函数</a></li>
<li><a href="#org48fab23">扩展函数</a></li>
<li><a href="#orgc33634a">高阶函数</a></li>
<li><a href="#org3adad01">尾递归函数</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1c55bb" class="outline-2">
<h2 id="orgf1c55bb">声明</h2>
<div class="outline-text-2" id="text-orgf1c55bb">
<p>
Kotlin 中的函数使用 <span class="underline">fun</span> 关键字声明：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">double</span>(x: <span style="color: #98f5ff;">Int</span>): <span style="color: #98f5ff;">Int</span> {
    <span style="color: #00bfff; font-weight: bold;">return</span> 2 * x
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4252b0" class="outline-2">
<h2 id="orge4252b0">用法</h2>
<div class="outline-text-2" id="text-orge4252b0">
<p>
调用函数使用传统的方法：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">result</span> = double(2)
</pre>
</div>

<p>
调用成员函数使用 <span class="underline">点</span> 表示法：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #98f5ff;">Stream</span>().read() <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314;&#31867; Stream &#23454;&#20363;&#24182;&#35843;&#29992; read()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org019589e" class="outline-2">
<h2 id="org019589e">参数</h2>
<div class="outline-text-2" id="text-org019589e">
<p>
函数参数使用 Pascal 表示法定义，即 <span class="underline">name: type</span> 。参数用 <span class="underline">逗号</span> 隔开。每个参数必须有 <b>显式</b> 类型：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">powerOf</span>(number: <span style="color: #98f5ff;">Int</span>, exponent: <span style="color: #98f5ff;">Int</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>
</div>
<div id="outline-container-org7f6caca" class="outline-3">
<h3 id="org7f6caca">默认参数</h3>
<div class="outline-text-3" id="text-org7f6caca">
<p>
函数参数可以有默认值，当省略相应的参数时使用默认值。与其他语言相比，这可以减少重载数量：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">read</span>(b: <span style="color: #98f5ff;">Array&lt;Byte&gt;</span>, off: <span style="color: #98f5ff;">Int</span> = 0, len: <span style="color: #98f5ff;">Int</span> = b.size) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<pre class="example">
     默认值通过类型后面的 = 及给出的值来定义
</pre>


<p>
覆盖方法总是使用与基类型方法相同的默认参数值。 当覆盖一个带有默认参数值的方法时，签名中不能再有默认参数值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">open</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">A</span> {
    <span style="color: #00bfff; font-weight: bold;">open</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(i: <span style="color: #98f5ff;">Int</span> = 10) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
}

<span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">B</span> : <span style="color: #98f5ff;">A</span>() {
    <span style="color: #00bfff; font-weight: bold;">override</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(i: <span style="color: #98f5ff;">Int</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }  <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#19981;&#33021;&#26377;&#40664;&#35748;&#20540;</span>
}
</pre>
</div>

<p>
如果一个默认参数在一个无默认值的参数之前，那么该默认值只能通过使用 <span class="underline">具名</span> 参数调用该函数来使用：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(bar: <span style="color: #98f5ff;">Int</span> = 0, baz: <span style="color: #98f5ff;">Int</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }

foo(baz = 1) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20351;&#29992;&#40664;&#35748;&#20540; bar = 0</span>
</pre>
</div>


<p>
如果在默认参数之后的 <span class="underline">最后一个</span> 参数是 <span class="underline">lambda 表达式</span> ，那么它既可以作为具名参数在括号内传入，也可以在括号外传入：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(bar: <span style="color: #98f5ff;">Int</span> = 0, baz: <span style="color: #98f5ff;">Int</span> = 1, qux: () -&gt; <span style="color: #98f5ff;">Unit</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }

foo(1) { println(<span style="color: #deb887;">"hello"</span>) }     <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20351;&#29992;&#40664;&#35748;&#20540; baz = 1</span>
foo(qux = { println(<span style="color: #deb887;">"hello"</span>) }) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20351;&#29992;&#20004;&#20010;&#40664;&#35748;&#20540; bar = 0 &#19982; baz = 1</span>
foo { println(<span style="color: #deb887;">"hello"</span>) }        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20351;&#29992;&#20004;&#20010;&#40664;&#35748;&#20540; bar = 0 &#19982; baz = 1</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef4c86f" class="outline-3">
<h3 id="orgef4c86f">具名参数</h3>
<div class="outline-text-3" id="text-orgef4c86f">
<p>
可以在调用函数时使用具名的函数参数
</p>

<pre class="example">
     当一个函数有大量的参数或默认参数时这会非常方便
</pre>

<p>
比如：
</p>
<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">reformat</span>(str: <span style="color: #98f5ff;">String</span>,
             normalizeCase: <span style="color: #98f5ff;">Boolean</span> = <span style="color: #ffd700;">true</span>,
             upperCaseFirstLetter: <span style="color: #98f5ff;">Boolean</span> = <span style="color: #ffd700;">true</span>,
             divideByCamelHumps: <span style="color: #98f5ff;">Boolean</span> = <span style="color: #ffd700;">false</span>,
             wordSeparator: <span style="color: #98f5ff;">Char</span> = <span style="color: #deb887;">' '</span>) {
<span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span>
}
</pre>
</div>

<p>
可以使用默认参数来调用它：
</p>
<div class="org-src-container">
<pre class="src src-kotlin">reformat(str)
</pre>
</div>

<p>
然而，当使用非默认参数调用它时，该调用看起来就像：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">reformat(str, <span style="color: #ffd700;">true</span>, <span style="color: #ffd700;">true</span>, <span style="color: #ffd700;">false</span>, <span style="color: #deb887;">'_'</span>)
</pre>
</div>

<p>
使用具名参数可以使代码更具有可读性：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">reformat(str,
    normalizeCase = <span style="color: #ffd700;">true</span>,
    upperCaseFirstLetter = <span style="color: #ffd700;">true</span>,
    divideByCamelHumps = <span style="color: #ffd700;">false</span>,
    wordSeparator = <span style="color: #deb887;">'_'</span>
)
</pre>
</div>

<p>
并且如果不需要所有的参数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">reformat(str, wordSeparator = <span style="color: #deb887;">'_'</span>)
</pre>
</div>


<p>
当一个函数调用混用位置参数与具名参数时，所有位置参数都要放在 <span class="underline">第一个具名参数之前</span> 
</p>

<pre class="example">
     例如，允许调用 f(1, y = 2) 但不允许 f(x = 1, 2)
</pre>
<p>
可以通过使用 <span class="underline">星号</span> 操作符将 <span class="underline">可变数量参数</span> (vararg) 以具名形式传入：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(<span style="color: #00bfff; font-weight: bold;">vararg</span> strings: <span style="color: #98f5ff;">String</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }

foo(strings = *arrayOf(<span style="color: #deb887;">"a"</span>, <span style="color: #deb887;">"b"</span>, <span style="color: #deb887;">"c"</span>))
</pre>
</div>


<pre class="example">
     对于 JVM 平台：在调用 Java 函数时不能使用具名参数语法，因为 Java 字节码并不总是保留函数参数的名称
</pre>
</div>
</div>
