src/kotlin/functional/function.org
** 可变数量的参数

   函数的参数（通常是最后一个）可以用 _vararg_ 修饰符标记：

   #+BEGIN_SRC kotlin 
  fun <T> asList(vararg ts: T): List<T> {
      val result = ArrayList<T>()
      for (t in ts) // ts is an Array
	  result.add(t)
      return result
  }
   #+END_SRC

   允许将可变数量的参数传递给函数：

   #+BEGIN_SRC kotlin 
  val list = asList(1, 2, 3)
   #+END_SRC

   #+BEGIN_EXAMPLE
     在函数内部，类型 T 的 vararg 参数的可见方式是作为 T 数组，即上例中的 ts 变量具有类型 Array <out T>
   #+END_EXAMPLE

   只有一个参数可以标注为 vararg。如果 vararg 参数不是列表中的最后一个参数：
   + 可以使用具名参数语法传递其后的参数的值
   + 或者，如果参数具有函数类型，则通过在括号外部传一个 lambda 

   #+BEGIN_EXAMPLE
     当调用 vararg 函数时，可以一个接一个地传参，例如 asList(1, 2, 3)
   #+END_EXAMPLE
   或者如果已经有一个数组并希望将其内容传给该函数，也可以使用 _伸展_ (spread) 操作符（在数组前面加 _*_ ）：

   #+BEGIN_SRC kotlin 
  val a = arrayOf(1, 2, 3)
  val list = asList(-1, 0, *a, 4)
   #+END_SRC

* 返回
  具有块代码体的函数必须始终 *显式* 指定返回类型 

  #+BEGIN_EXAMPLE
    除非他们旨在返回 Unit，在这种情况下它是可选的

    Kotlin 不推断具有块代码体的函数的返回类型，因为这样的函数在代码体中可能有复杂的控制流，并且返回类型对于读者（有时甚至对于编译器）是不明显的
  #+END_EXAMPLE

** 返回 Unit 的函数

   如果一个函数不返回任何有用的值，它的返回类型是 _Unit_ 。Unit 是一种只有一个值 Unit 的类型。这个值不需要显式返回：

   #+BEGIN_SRC kotlin 
  fun printHello(name: String?): Unit {
      if (name != null)
	  println("Hello ${name}")
      else
	  println("Hi there!")
      // `return Unit` 或者 `return` 是可选的
  }
   #+END_SRC

   Unit 返回类型声明也是可选的。上面的代码等同于：

   #+BEGIN_SRC kotlin 
  fun printHello(name: String?) { …… }
   #+END_SRC
** 单表达式函数

   当函数返回单个表达式时，可以 *省略* _花括号_ 并且在 _=_ 符号之后 *指定* _代码体_ 即可：

   #+BEGIN_SRC kotlin 
  fun double(x: Int): Int = x * 2
   #+END_SRC


   当返回值类型可由编译器推断时，显式声明返回类型是 _可选_ 的：

   #+BEGIN_SRC kotlin 
  fun double(x: Int) = x * 2
   #+END_SRC

* 中缀表示法
  标有 _infix_ 关键字的函数也可以使用中缀表示法（ *忽略* 该调用的 _点_ 与 _圆括号_ ）调用。中缀函数必须满足以下要求：
  + 它们 *必须* 是 _成员_ 函数或 _扩展_ 函数
  + 它们必须 *只有* _一个_ 参数
  + 其参数 *不得接受* _可变数量_ 的参数且 *不能* 有 _默认值_ 

  #+BEGIN_SRC kotlin 
  infix fun Int.shl(x: Int): Int { …… }

  // 用中缀表示法调用该函数
  1 shl 2

  // 等同于这样
  1.shl(2)
  #+END_SRC

  请注意：
  + 中缀函数总是要求指定 _接收者_ 与 _参数_
  + 当使用中缀表示法在当前接收者上调用方法时，需要显式使用 this
    #+BEGIN_EXAMPLE
      不能像常规方法调用那样省略。这是确保非模糊解析所必需的
    #+END_EXAMPLE

  #+BEGIN_SRC kotlin 
  class MyStringCollection {
      infix fun add(s: String) { /*……*/ }

      fun build() {
	  this add "abc"   // 正确
	  add("abc")       // 正确
	  //add "abc"        // 错误：必须指定接收者
      }
  }
  #+END_SRC

  #+BEGIN_EXAMPLE
    中缀函数调用的优先级低于算术操作符、类型转换以及 rangeTo 操作符。 以下表达式是等价的：

    1 shl 2 + 3 等价于 1 shl (2 + 3)
    0 until n * 2 等价于 0 until (n * 2)
    xs union ys as Set<*> 等价于 xs union (ys as Set<*>)

    另一方面，中缀函数调用的优先级高于布尔操作符 && 与 ||、is- 与 in- 检测以及其他一些操作符。这些表达式也是等价的：

    a && b xor c 等价于 a && (b xor c)
    a xor b in c 等价于 (a xor b) in c
  #+END_EXAMPLE
* 作用域
  在 Kotlin 中函数可以在文件 *顶层* 声明

  #+BEGIN_EXAMPLE
    这意味着你不需要像一些语言如 Java、C# 或 Scala 那样需要创建一个类来保存一个函数
  #+END_EXAMPLE

  此外除了顶层函数，Kotlin 中函数也可以声明在 *局部作用域* 、作为 _成员_ 函数以及 _扩展_ 函数 
** 局部函数

   Kotlin 支持局部函数，即一个函数在另一个函数内部：

   #+BEGIN_SRC kotlin 
  fun dfs(graph: Graph) {
      fun dfs(current: Vertex, visited: MutableSet<Vertex>) {
	  if (!visited.add(current)) return
	  for (v in current.neighbors)
	      dfs(v, visited)
      }

      dfs(graph.vertices[0], HashSet())
  }
   #+END_SRC

   局部函数可以访问外部函数（即 _闭包_ ）的局部变量，所以在上例中，visited 可以是局部变量：

   #+BEGIN_SRC kotlin 
  fun dfs(graph: Graph) {
      val visited = HashSet<Vertex>()
      fun dfs(current: Vertex) {
	  if (!visited.add(current)) return
	  for (v in current.neighbors)
	      dfs(v)
      }

      dfs(graph.vertices[0])
  }
   #+END_SRC
** 成员函数

   成员函数是在类或对象内部定义的函数：

   #+BEGIN_SRC kotlin 
  class Sample() {
      fun foo() { print("Foo") }
  }
   #+END_SRC

   成员函数以点表示法调用：

   #+BEGIN_SRC kotlin 
  Sample().foo() // 创建类 Sample 实例并调用 foo
   #+END_SRC
