html/kotlin/functional/function.html
<div id="outline-container-orgbc15531" class="outline-3">
<h3 id="orgbc15531">可变数量的参数</h3>
<div class="outline-text-3" id="text-orgbc15531">
<p>
函数的参数（通常是最后一个）可以用 <span class="underline">vararg</span> 修饰符标记：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #98f5ff;">T&gt;</span> asList(<span style="color: #00bfff; font-weight: bold;">vararg</span> ts: <span style="color: #98f5ff;">T</span>): <span style="color: #98f5ff;">List&lt;T&gt;</span> {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">result</span> = <span style="color: #98f5ff;">ArrayList&lt;T&gt;</span>()
    <span style="color: #00bfff; font-weight: bold;">for</span> (t <span style="color: #00bfff; font-weight: bold;">in</span> ts) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">ts is an Array</span>
        result.add(t)
    <span style="color: #00bfff; font-weight: bold;">return</span> result
}
</pre>
</div>

<p>
允许将可变数量的参数传递给函数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">list</span> = asList(1, 2, 3)
</pre>
</div>

<pre class="example">
     在函数内部，类型 T 的 vararg 参数的可见方式是作为 T 数组，即上例中的 ts 变量具有类型 Array &lt;out T&gt;
</pre>

<p>
只有一个参数可以标注为 vararg。如果 vararg 参数不是列表中的最后一个参数：
</p>
<ul class="org-ul">
<li>可以使用具名参数语法传递其后的参数的值</li>
<li>或者，如果参数具有函数类型，则通过在括号外部传一个 lambda</li>
</ul>

<pre class="example">
     当调用 vararg 函数时，可以一个接一个地传参，例如 asList(1, 2, 3)
</pre>
<p>
或者如果已经有一个数组并希望将其内容传给该函数，也可以使用 <span class="underline">伸展</span> (spread) 操作符（在数组前面加 <span class="underline">*</span> ）：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">a</span> = arrayOf(1, 2, 3)
<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">list</span> = asList(-1, 0, *a, 4)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9c16161" class="outline-2">
<h2 id="org9c16161">返回</h2>
<div class="outline-text-2" id="text-org9c16161">
<p>
具有块代码体的函数必须始终 <b>显式</b> 指定返回类型 
</p>

<pre class="example">
除非他们旨在返回 Unit，在这种情况下它是可选的

Kotlin 不推断具有块代码体的函数的返回类型，因为这样的函数在代码体中可能有复杂的控制流，并且返回类型对于读者（有时甚至对于编译器）是不明显的
</pre>
</div>

<div id="outline-container-orge9c9180" class="outline-3">
<h3 id="orge9c9180">返回 Unit 的函数</h3>
<div class="outline-text-3" id="text-orge9c9180">
<p>
如果一个函数不返回任何有用的值，它的返回类型是 <span class="underline">Unit</span> 。Unit 是一种只有一个值 Unit 的类型。这个值不需要显式返回：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">printHello</span>(name: <span style="color: #98f5ff;">String?</span>): <span style="color: #98f5ff;">Unit</span> {
    <span style="color: #00bfff; font-weight: bold;">if</span> (name != <span style="color: #ffd700;">null</span>)
        println(<span style="color: #deb887;">"Hello ${</span>name<span style="color: #deb887;">}"</span>)
    <span style="color: #00bfff; font-weight: bold;">else</span>
        println(<span style="color: #deb887;">"Hi there!"</span>)
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">`return Unit` &#25110;&#32773; `return` &#26159;&#21487;&#36873;&#30340;</span>
}
</pre>
</div>

<p>
Unit 返回类型声明也是可选的。上面的代码等同于：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">printHello</span>(name: <span style="color: #98f5ff;">String?</span>) { &#8230;&#8230; }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc394aa" class="outline-3">
<h3 id="orgbc394aa">单表达式函数</h3>
<div class="outline-text-3" id="text-orgbc394aa">
<p>
当函数返回单个表达式时，可以 <b>省略</b> <span class="underline">花括号</span> 并且在 <span class="underline">=</span> 符号之后 <b>指定</b> <span class="underline">代码体</span> 即可：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">double</span>(x: <span style="color: #98f5ff;">Int</span>): <span style="color: #98f5ff;">Int</span> = x * 2
</pre>
</div>


<p>
当返回值类型可由编译器推断时，显式声明返回类型是 <span class="underline">可选</span> 的：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">double</span>(x: <span style="color: #98f5ff;">Int</span>) = x * 2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8f2ae6f" class="outline-2">
<h2 id="org8f2ae6f">中缀表示法</h2>
<div class="outline-text-2" id="text-org8f2ae6f">
<p>
标有 <span class="underline">infix</span> 关键字的函数也可以使用中缀表示法（ <b>忽略</b> 该调用的 <span class="underline">点</span> 与 <span class="underline">圆括号</span> ）调用。中缀函数必须满足以下要求：
</p>
<ul class="org-ul">
<li>它们 <b>必须</b> 是 <span class="underline">成员</span> 函数或 <span class="underline">扩展</span> 函数</li>
<li>它们必须 <b>只有</b> <span class="underline">一个</span> 参数</li>
<li>其参数 <b>不得接受</b> <span class="underline">可变数量</span> 的参数且 <b>不能</b> 有 <span class="underline">默认值</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">infix</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #98f5ff;">Int.shl</span>(x: <span style="color: #98f5ff;">Int</span>): <span style="color: #98f5ff;">Int</span> { &#8230;&#8230; }

<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#29992;&#20013;&#32512;&#34920;&#31034;&#27861;&#35843;&#29992;&#35813;&#20989;&#25968;</span>
1 shl 2

<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#31561;&#21516;&#20110;&#36825;&#26679;</span>
1.shl(2)
</pre>
</div>

<p>
请注意：
</p>
<ul class="org-ul">
<li>中缀函数总是要求指定 <span class="underline">接收者</span> 与 <span class="underline">参数</span></li>
<li><p>
当使用中缀表示法在当前接收者上调用方法时，需要显式使用 this
</p>
<pre class="example">
      不能像常规方法调用那样省略。这是确保非模糊解析所必需的
</pre></li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">MyStringCollection</span> {
    <span style="color: #00bfff; font-weight: bold;">infix</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">add</span>(s: <span style="color: #98f5ff;">String</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }

    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">build</span>() {
        <span style="color: #00bfff; font-weight: bold;">this</span> add <span style="color: #deb887;">"abc"</span>   <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27491;&#30830;</span>
        add(<span style="color: #deb887;">"abc"</span>)       <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27491;&#30830;</span>
        <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">add "abc"        // &#38169;&#35823;&#65306;&#24517;&#39035;&#25351;&#23450;&#25509;&#25910;&#32773;</span>
    }
}
</pre>
</div>

<pre class="example">
中缀函数调用的优先级低于算术操作符、类型转换以及 rangeTo 操作符。 以下表达式是等价的：

1 shl 2 + 3 等价于 1 shl (2 + 3)
0 until n * 2 等价于 0 until (n * 2)
xs union ys as Set&lt;*&gt; 等价于 xs union (ys as Set&lt;*&gt;)

另一方面，中缀函数调用的优先级高于布尔操作符 &amp;&amp; 与 ||、is- 与 in- 检测以及其他一些操作符。这些表达式也是等价的：

a &amp;&amp; b xor c 等价于 a &amp;&amp; (b xor c)
a xor b in c 等价于 (a xor b) in c
</pre>
</div>
</div>
<div id="outline-container-orgcbd94b7" class="outline-2">
<h2 id="orgcbd94b7">作用域</h2>
<div class="outline-text-2" id="text-orgcbd94b7">
<p>
在 Kotlin 中函数可以在文件 <b>顶层</b> 声明
</p>

<pre class="example">
    这意味着你不需要像一些语言如 Java、C# 或 Scala 那样需要创建一个类来保存一个函数
</pre>

<p>
此外除了顶层函数，Kotlin 中函数也可以声明在 <b>局部作用域</b> 、作为 <span class="underline">成员</span> 函数以及 <span class="underline">扩展</span> 函数 
</p>
</div>
<div id="outline-container-org612d41b" class="outline-3">
<h3 id="org612d41b">局部函数</h3>
<div class="outline-text-3" id="text-org612d41b">
<p>
Kotlin 支持局部函数，即一个函数在另一个函数内部：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">dfs</span>(graph: <span style="color: #98f5ff;">Graph</span>) {
    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">dfs</span>(current: <span style="color: #98f5ff;">Vertex</span>, visited: <span style="color: #98f5ff;">MutableSet&lt;Vertex&gt;</span>) {
        <span style="color: #00bfff; font-weight: bold;">if</span> (!visited.add(current)) <span style="color: #00bfff; font-weight: bold;">return</span>
        <span style="color: #00bfff; font-weight: bold;">for</span> (v <span style="color: #00bfff; font-weight: bold;">in</span> current.neighbors)
            dfs(v, visited)
    }

    dfs(graph.vertices[0], <span style="color: #98f5ff;">HashSet</span>())
}
</pre>
</div>

<p>
局部函数可以访问外部函数（即 <span class="underline">闭包</span> ）的局部变量，所以在上例中，visited 可以是局部变量：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">dfs</span>(graph: <span style="color: #98f5ff;">Graph</span>) {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">visited</span> = <span style="color: #98f5ff;">HashSet&lt;Vertex&gt;</span>()
    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">dfs</span>(current: <span style="color: #98f5ff;">Vertex</span>) {
        <span style="color: #00bfff; font-weight: bold;">if</span> (!visited.add(current)) <span style="color: #00bfff; font-weight: bold;">return</span>
        <span style="color: #00bfff; font-weight: bold;">for</span> (v <span style="color: #00bfff; font-weight: bold;">in</span> current.neighbors)
            dfs(v)
    }

    dfs(graph.vertices[0])
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge775e86" class="outline-3">
<h3 id="orge775e86">成员函数</h3>
<div class="outline-text-3" id="text-orge775e86">
<p>
成员函数是在类或对象内部定义的函数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Sample</span>() {
    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() { print(<span style="color: #deb887;">"Foo"</span>) }
}
</pre>
</div>

<p>
成员函数以点表示法调用：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #98f5ff;">Sample</span>().foo() <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21019;&#24314;&#31867; Sample &#23454;&#20363;&#24182;&#35843;&#29992; foo</span>
</pre>
</div>
</div>
</div>
</div>
